{"uid":"an-analogue-camera","content":"Watching a professional photographer at work today. All digital, of course. I'm not sure anyone argues the case for using film in still photography anymore. At least not for anything beyond sheer appreciation.\n\nAlthough I remember clearly, in the beginning, they did. To the extent that not only were the tools of the day insufficient in comparison to \"real\" photography (they were) but also that digital could <em>never<\/em> reach the same levels of quality nor, consequently, acceptance as the analogue counterpart.\n\nAnyone with an understanding of technology might see the issue of <em>image quality<\/em> as being only a matter of time, but it's interesting that winning that battle wasn't really the great triumph that made digital as ubiquitous as it is today. That <em>most<\/em> triumphant victory over it's predecessor turned out to be all the things you never could have dreamt of.\n\nIt's difficult to fathom the idea of instant previews or the freedom to shoot everything and edit later without having a frame of reference. Instagram, Twitter, and instant publishing, or the notion that a point-and-shoot will one day rival the quality and features of an SLR – and a <em>mobile phone<\/em> rival them both – would have been all but inconceivable in the world at that time. In today's world, it's simply difficult not to take all those things for granted.\n\nI can remember similar sentiments, some still being expressed to varying degrees, around music, video, books, magazines and I'm sure others. In each case there's an argument of quality or something lost in the transition, and in each case technology has or will improve to equalize and compensate where it has to. But again, I believe the <em>real<\/em> value comes from the <em>possibilities<\/em>. From what's <em>new<\/em>, not from the few bits comparable to the past.\n\nDigital photography isn't better because we've got more megapixels now. It's better because the journalist on assignment can beam her shots around the world the instant they're taken and publish live from the field. It's better because <em>I can do that too<\/em>! Image quality doesn't mater a half next to that. That's exciting.\n\nToday that analogue camera comes to mind when I listen to people talk about education and politics. A digital revolution in these areas needn't result in a like for like replacement of established norms to be successful or worthwhile. It's foolish to think that they would. The established norms in education are incompatible with a world where Wikipedia and Udacity and GitHub exist. Politics is something else when everyone <em>really can<\/em> have a voice. \n\nAs a tool in our current system, and mindset, the Internet can only do so much to improve upon what's already there. But as an abstract, taken as something new and unique from the old, the possibilities are untold.\n\nAnd that, I think, is really exciting.","date":"March 29, 2013 19:11","title":"An Analogue Camera","article_css":"","template_file":false,"categories":["Technology","Uncategorized"],"author":"Michael Flanagan"}