{"uid":"in-an-extroverts-world","content":"<img src=\"\/assets\/\/2012\/03\/introverts.png\" alt=\"\" title=\"introverts\" class=\"alignnone size-full wp-image-137\" \/>\r\n\r\nIt took me a while to become comfortable as an introvert -- or to even acknowledge that <em>being an introvert<\/em> was an acceptable thing to be, and not something which should be shaken off or grown out of eventually. These days I try to stop apologising and making excuses. I don't crave the attention of a crowd and I don't gain energy from the energy and enthusiasm of having many people around me. In those situations I find myself sitting quietly, observing, listening. I'll form my opinions and contribute in my own way, in my own time. I don't enjoy the rabble.\r\n\r\nPeople observing this often put it down to shyness, social awkwardness or an unhealthy aversion to people. That's not the case. Forcing yourself to conform to an outgoing extrovert norm <em>can<\/em> be awkward -- as much as trying anything which goes against your natural instincts and impulses -- but as an introvert needs seem different to the majority who require regular social interactions for a steady, healthy mind. I like the small doses, absolutely, but without having my time alone to recharge, think, dream and create -- I'm liable to get a little cranky.\r\n\r\nThe difference of acceptance is that I'm now willing to embrace the time alone, trying to make the most out of it and not feeling guilty or inadequate for sitting in with a cup of tea researching <a href=\"http:\/\/nodejs.org\/\">Node.js<\/a> or <a href=\"http:\/\/www.codecademy.com\/\">brushing up on my JavaScript<\/a> on a Saturday night. Weekends are a mess of extroversion and social excess; I'll catch up with my friends during the week. And I'll look forward to that.\r\n\r\nBut. There is also the reality which is not wise to ignore: it's an extroverts world out there. As a society we tend to celebrate those who can shout the loudest, network the farthest and mesmerise an audience with the power of their voice and presence. These are fantastic and certainly enviable qualities to have, to an introvert they're far from natural. Thus we risk being forgotten, left on the bank as the river of extroversion rushes past towards an ocean of opportunities.\r\n\r\nAs introverts we need to both embrace this side of our personalities but also we must learn how to live and prosper in the extroverts world. The Internet certainly offers many great opportunities (keeping a blog, for instance) -- while at other times it really is worth putting that extra effort in and stepping, momentarily, outside the comfort zones. Just don't feel bad for maintaining the balance that's healthy <em>for you<\/em>.\r\n\r\nSee links below for more tails of introversion and tips for keeping up with all those beautiful extroverts out there.\r\n\r\n<hr \/>\r\n\r\n<h5>Further reading \/ viewing<\/h5>\r\n<ul>\r\n\t<li>A nice, short, and on-topic SlideShare presentation I read this week is <a href=\"http:\/\/www.slideshare.net\/sachac\/the-shy-connector\">The Shy Connector<\/a> from Sacha Chua, which offers 7 tips on how to network and influence people without forsaking the natural introvert inside.<\/li>\r\n\t<li>A recent TED talk entitled <a href=\"http:\/\/www.ted.com\/talks\/susan_cain_the_power_of_introverts.html\">The Power of Introverts<\/a> by Susan Cain offers her story of accepting and embracing her own introversion. (<a href=\"http:\/\/www.youtube.com\/embed\/3yyeJ1jaGDU\">Alternative YouTube link<\/a>).<\/li>\r\n\t<li>And something I found enlightening and inspirational when I first read it last year -- <a href=\"http:\/\/www.carlkingdom.com\/10-myths-about-introverts\">10 Myths About Introverts<\/a> by Carl King.<\/li>\r\n<\/ul>","date":"March 5, 2012 05:23","title":"In an Extroverts World.","article_css":"","template_file":false,"categories":["Personal"],"author":"Michael Flanagan"}