[{"id":322,"permalink":"http:\/\/micflan.com\/mass-effect\/","title":"Mass Effect","content":"Playing Mass Effect 2 at the moment. It’s impossible to have same sex relationship because the devs wanted a <a href=\"http:\/\/www.1up.com\/do\/blogEntry?bId=9026170\">“PG-13 action movie” feel<\/a>. Other relationships are fine. Jokes about “not taking a shower” on the prison planet are seemingly OK too. I am disappoint.\r\n\r\nSo far, ME2 is just mostly disappointing though. Think I read too much about it being the best in the series before I played. Just seems like more of a generic over-the-sholder shooter, compared with the depth of the first one. Not bad… just not as good.\r\n\r\nCase in point, I didn’t stop to think or care about the lack of same-sex relationships while I played through the original Mass Effect.","excerpt":"Playing Mass Effect 2 at the moment. It’s impossible to have same sex relationship because the devs wanted a “PG-13 action movie” feel. Other relationships are fine. Jokes about “not taking a shower” on the prison planet are seemingly OK too. I am disappoint. So far, ME2 is just mostly disappointing though. Think I read [...]","date":"April 11, 2013 01:34","categories":[{"id":13,"title":"Gaming","slug":"gaming"},{"id":8,"title":"Gay \/ LGBT","slug":"gay-lgbt"}],"tags":[]},{"id":315,"permalink":"http:\/\/micflan.com\/an-analogue-camera\/","title":"An Analogue Camera","content":"Watching a professional photographer at work today. All digital, of course. I'm not sure anyone argues the case for using film in still photography anymore. At least not for anything beyond sheer appreciation.\n\nAlthough I remember clearly, in the beginning, they did. To the extent that not only were the tools of the day insufficient in comparison to \"real\" photography (they were) but also that digital could <em>never<\/em> reach the same levels of quality nor, consequently, acceptance as the analogue counterpart.\n\nAnyone with an understanding of technology might see the issue of <em>image quality<\/em> as being only a matter of time, but it's interesting that winning that battle wasn't really the great triumph that made digital as ubiquitous as it is today. That <em>most<\/em> triumphant victory over it's predecessor turned out to be all the things you never could have dreamt of.\n\nIt's difficult to fathom the idea of instant previews or the freedom to shoot everything and edit later without having a frame of reference. Instagram, Twitter, and instant publishing, or the notion that a point-and-shoot will one day rival the quality and features of an SLR – and a <em>mobile phone<\/em> rival them both – would have been all but inconceivable in the world at that time. In today's world, it's simply difficult not to take all those things for granted.\n\nI can remember similar sentiments, some still being expressed to varying degrees, around music, video, books, magazines and I'm sure others. In each case there's an argument of quality or something lost in the transition, and in each case technology has or will improve to equalize and compensate where it has to. But again, I believe the <em>real<\/em> value comes from the <em>possibilities<\/em>. From what's <em>new<\/em>, not from the few bits comparable to the past.\n\nDigital photography isn't better because we've got more megapixels now. It's better because the journalist on assignment can beam her shots around the world the instant they're taken and publish live from the field. It's better because <em>I can do that too<\/em>! Image quality doesn't mater a half next to that. That's exciting.\n\nToday that analogue camera comes to mind when I listen to people talk about education and politics. A digital revolution in these areas needn't result in a like for like replacement of established norms to be successful or worthwhile. It's foolish to think that they would. The established norms in education are incompatible with a world where Wikipedia and Udacity and GitHub exist. Politics is something else when everyone <em>really can<\/em> have a voice. \n\nAs a tool in our current system, and mindset, the Internet can only do so much to improve upon what's already there. But as an abstract, taken as something new and unique from the old, the possibilities are untold.\n\nAnd that, I think, is really exciting.","excerpt":"Watching a professional photographer at work today. All digital, of course. I&#8217;m not sure anyone argues the case for using film in still photography anymore. At least not for anything beyond sheer appreciation. Although I remember clearly, in the beginning, they did. To the extent that not only were the tools of the day insufficient [...]","date":"March 29, 2013 19:11","categories":[{"id":7,"title":"Technology","slug":"technology"},{"id":1,"title":"Uncategorized","slug":"uncategorized"}],"tags":[]},{"id":310,"permalink":"http:\/\/micflan.com\/working-please-wait\/","title":"Working. Please Wait&#8230;","content":"Recently, I've been working on two projects.\r\n\r\n<a href=\"http:\/\/gethealthapp.com\">GetHealth<\/a> is a start-up I joined as CTO last year which \"is helping people become more healthy every day\", with game-play incentivised mobile applications and health challenges for companies and groups.\r\n\r\n<a href=\"http:\/\/anseoapp.com\">Anseo<\/a> is a mobile application by <a href=\"http:\/\/diaga.ie\">Diaga<\/a>, which in turn is a web and design shop I helped establish to work on various projects. Anseo is a location-aware chat and discovery application for Irish speakers and the Irish language community.","excerpt":"Recently, I&#8217;ve been working on two projects. GetHealth is a start-up I joined as CTO last year which &#8220;is helping people become more healthy every day&#8221;, with game-play incentivised mobile applications and health challenges for companies and groups. Anseo is a mobile application by Diaga, which in turn is a web and design shop I [...]","date":"March 28, 2013 02:53","categories":[{"id":12,"title":"I Made This","slug":"i-made-this"},{"id":3,"title":"Personal","slug":"personal"}],"tags":[]},{"id":302,"permalink":"http:\/\/micflan.com\/tunes\/","title":"Tunes.","content":"Based on <a href=\"http:\/\/www.last.fm\/user\/goodshape\">25500 tracks logged<\/a> since 11 July 2006...\r\n\r\nI'm into rock, indie, electronic, alternative and experimental, including:\r\n\r\nThe Beatles, Radiohead, Pearl Jam, Nirvana, The Smashing Pumpkins, Led Zeppelin, The American Analog Set, Nine Inch Nails, John Lennon, Four Tet, Kings of Leon, Devendra Banhart, Trent Reznor and Atticus Ross, Arcade Fire, David Bowie, Calexico, Sigur Rós, Björk, Neil Young, Pulp, Rage Against the Machine, Vangelis, Gorillaz, Queens of the Stone Age, Blur, Air, The Flaming Lips, Frank Zappa, Ian Brown, Foo Fighters, Beirut, Jape, Boards of Canada, Maybeshewill, The Redneck Manifesto, Bob Dylan, Grandaddy, Scissor Sisters, The White Stripes, Godspeed You! Black Emperor, Philip Glass, My Bloody Valentine, R.E.M., Pink Floyd, Manu Chao, Jimi Hendrix, Rory Gallagher, Aim, Max Richter, The Smiths.\r\n\r\nCheck out my music taste: <a href=\"http:\/\/www.last.fm\/user\/goodshape\">http:\/\/www.last.fm\/user\/goodshape<\/a>","excerpt":"Based on 25500 tracks logged since 11 July 2006&#8230; I&#8217;m into rock, indie, electronic, alternative and experimental, including: The Beatles, Radiohead, Pearl Jam, Nirvana, The Smashing Pumpkins, Led Zeppelin, The American Analog Set, Nine Inch Nails, John Lennon, Four Tet, Kings of Leon, Devendra Banhart, Trent Reznor and Atticus Ross, Arcade Fire, David Bowie, Calexico, [...]","date":"March 21, 2013 11:47","categories":[{"id":9,"title":"Music","slug":"music"}],"tags":[]},{"id":292,"permalink":"http:\/\/micflan.com\/thoughts-on-enhancing-your-phpness\/","title":"Thoughts on enhancing your PHPness","content":"<a href=\"http:\/\/micflan.com\/wp-content\/uploads\/2013\/02\/phpness.jpg\" alt=\"Enhance your PHPness\">This t-shirt<\/a> caused <a href=\"http:\/\/blog.calevans.com\/2013\/02\/22\/sexism-and-php\/\">a bit of<\/a> a <a href=\"http:\/\/www.brandonsavage.net\/on-public-outrage-and-bad-actors\/\">moral outrage<\/a> recently following a PHP conference in London. I've commented on Twitter and on a couple of <a href=\"http:\/\/erikaheidi.com\/2013\/02\/24\/the-phpness-riot-and-the-sexism-overreaction\/\">blog posts<\/a> and I'd also like to record my thoughts here, for the record.\r\n\r\nFor me, the question of it being appropriate or not among professionals or at a conference is a separate issue. If that were the argument being raised I suspect it would (rightfully) be a quieter one, and I’d be leaning towards the position that no, it’s not the most appropriate slogan.\r\n\r\nBut sexism – “discrimination on the basis of sex” – I’m deeply disappointed that some in the community would be so quick, brutal, and public with that accusation. Even going so far as to state unequivocally that any argument to the contrary is <a href=\"http:\/\/www.brandonsavage.net\/on-public-outrage-and-bad-actors\/\">“part of the problem”<\/a>. It’s a sad day when discussion is disallowed.\r\n\r\nYes we can strive for more professionalism within the community, but we are all adults here. There is absolutely a difference between a mild sexual reference pun and sexual discrimination.\r\n\r\nIt also seems there were many who <a href=\"https:\/\/gist.github.com\/AmyStephen\/5021337\">quickly jumped to the conclusion<\/a> (and apologised for only as an aside) that these women were some sort of hired “Booth Babes”. If that were your assumption then I think a long look in the mirror is needed before you start bandying around accusations of sexism.\r\n\r\nI sincerely believe that apologies are in order and I wish the women – and men – at <a href=\"webandphp.com\">webandphp.com<\/a> all the best in future. A slight misstep in humour is by no means deserving of this very public, serious and potentially damaging accusation.","excerpt":"This t-shirt caused a bit of a moral outrage recently following a PHP conference in London. I&#8217;ve commented on Twitter and on a couple of blog posts and I&#8217;d also like to record my thoughts here, for the record. For me, the question of it being appropriate or not among professionals or at a conference [...]","date":"February 25, 2013 12:55","categories":[{"id":3,"title":"Personal","slug":"personal"},{"id":7,"title":"Technology","slug":"technology"},{"id":5,"title":"Web","slug":"web"}],"tags":[]},{"id":272,"permalink":"http:\/\/micflan.com\/openvpn-on-amazon-aws-free-usage-tier\/","title":"OpenVPN on Amazon AWS Free Usage Tier","content":"I finally got around to setting up my <a href=\"http:\/\/en.wikipedia.org\/wiki\/Virtual_private_network\" target=\"_blank\">VPN server<\/a> last night on Amazon Web Services. Following a couple of guides made the whole thing fairly painless – so mostly I'm just going to point towards them, with a couple of notes of my own.\r\n\r\n<h3>VPN?<\/h3>\r\nFirstly, a VPN server (those who know can skip this bit) is literally a <em>Virtual Private Network<\/em>. You might be familiar with how your home or office network operates – many computers connected to the same WiFi or ethernet network. For the most part we do this simply to share an Internet connection, however, another upshot is the ability to share files and services (e.g. documents, audio, video, printers or scanners) between these machines – with access only available to machines on your <em>local network<\/em>.\r\n\r\nYou can think of a VPN in similar terms, only the <em>Local<\/em> is replaced with <em>Virtual Private<\/em>. The physical connection between what were once, by necessity, centrally located machines is replaced with a Virtual connection – and your access to those files and services is now available from any authenticated machine with a data connection, anywhere in the world. Pretty cool.\r\n\r\n<h3>OK, what do I need?<\/h3>\r\n\r\nAt it's simplest, creating a VPN requires two components – you need a server running the server component, and a client to connect to it. Actually it only <em>really<\/em> starts making sense when you have two clients (a network of one isn't much of a network!), but the setting up of the second is just the same as the first.\r\n\r\n<h4>Client<\/h4>\r\nYour first client could be the machine you're reading this on now, or any laptop or computer you want to use. \r\n\r\nMy client machine is running Linux (Mint 14). If you're on an Apple machine most of this guide should still be relevant – although perhaps the client setup will differ.\r\n\r\n<h4>Server<\/h4>\r\nFor the server I decided to use Amazon Web Services, mostly because I've still got a few months left on their <a href=\"http:\/\/aws.amazon.com\/free\/\" target=\"_blank\">Free Usage Tier<\/a> and you just can't beat that price.\r\n\r\n<h3>Step 1 – Setting up on Amazon Web Services<\/h3>\r\nThis <a href=\"http:\/\/expedienttech.net\/?p=68\" target=\"_blank\">guide by Expedient Tech<\/a> covers setting up your EC2 server. Follow this but go for Ubuntu 12.04 instead of 9.1. I don't see any reason to go back that far, maybe the guide is just old.\r\n\r\nWhen they start talking about using PuTTy and installing OpenVPN that way, forget about it. That's crazy Windows talk. All you need is shell access and by now you have the pem key from amazon, so – on your client machine – you just need to fire up a terminal window and type:\r\n\r\n<code>ssh -i \/path\/to\/yourkey.pem ubuntu@your-sever-address.amazonaws.com<\/code>\r\n\r\nYou should now be logged-in to your new Amazon EC2 instance.\r\n\r\n<h3>Step 2 & 3 – OpenVPN Client and Server<\/h3>\r\nNow switch to <a href=\"https:\/\/help.ubuntu.com\/12.04\/serverguide\/openvpn.html\" target=\"_blank\">Ubuntu 12.04's OpenVPN guide<\/a>. Follow those steps to the letter and you should be setup on both Server and Client.\r\n\r\n<h3>And...<\/h3>\r\nAnd.. that should be that! You can generate a second client certificate the same way you've done the first and connect a second machine. Each client connected to the network is given a unique IP address available only to other machines on the network, allowing you to connect and share securely. Sit happily in a coffee shop while you finish up a project on the machine back home, via your humble little laptop. Or stream music from your private collection through your phone at a party.\r\n\r\nLots of fun.","excerpt":"I finally got around to setting up my VPN server last night on Amazon Web Services. Following a couple of guides made the whole thing fairly painless – so mostly I&#8217;m just going to point towards them, with a couple of notes of my own. VPN? Firstly, a VPN server (those who know can skip this [...]","date":"January 27, 2013 02:59","categories":[{"id":7,"title":"Technology","slug":"technology"}],"tags":[]},{"id":253,"permalink":"http:\/\/micflan.com\/star-wars-machete-order\/","title":"Star Wars: Machete Order","content":"I did the Star Wars 'Machete Order' over the recent Christmas break. <a href=\"http:\/\/static.nomachetejuggling.com\/machete_order.html\">The website<\/a> goes into detail but in a nutshell, it involves watching Episodes 4, 5, 2, 3 and 6. In that order.\r\n\r\nNote that this isn't about watching them back-to-back in a massive marathon sitting! Well, not unless you want to. This is just about the order you watch them in.\r\n\r\nTurned out to be a great way to watch the films. Nothing is missed from leaving out episode one and the remaining two prequel episodes fit in at a time, just after Empire Strikes Back, when you're perfectly primed and eager to learn more about the Anakin\/Vader backstory. And it all gets nicely concluded with Episode 6.\r\n\r\nViewing in chronological order, 1 to 6 or even 2 to 6, is far too much information far too soon. The mystery of Darth Vader is diminished by the time you get to Episode 4, the revelation in 5 is meaningless.\r\n\r\nViewing in release order isn't much better. With 4 to 6 followed by 1 to 3, you're left with an ending in the middle and a middle at the end (Episode 3 ends on quite a downer!). So really, 'Machete Order' makes a lot of sense.\r\n\r\nAlso nice to remember that A New Hope and Empire Strikes Back are still fantastic films. Thoroughly enjoyed watching them both again. Attack of the Clones was the worst of the bunch by a fair margin but after Empire the backstory and details do at least seem more interesting. Revenge of the Sith was much better than I remembered! And Return of the Jedi was pretty much just as I'd remembered. Good in places, silly or dull in others, and the cast seems a little less enthusiastic and a bit older all of a sudden.\r\n\r\nAnd if you're going to do this -- or watch any Star Wars ever again -- do yourself a favour, Google and download the 'Despecialized Edition'. Brilliant 'blu-ray quality' restorations of the <em>original<\/em> Original Trilogy. Insanely great.","excerpt":"I did the Star Wars &#8216;Machete Order&#8217; over the recent Christmas break. The website goes into detail but in a nutshell, it involves watching Episodes 4, 5, 2, 3 and 6. In that order. Note that this isn&#8217;t about watching them back-to-back in a massive marathon sitting! Well, not unless you want to. This is [...]","date":"January 9, 2013 17:34","categories":[{"id":4,"title":"Film","slug":"film"}],"tags":[]},{"id":255,"permalink":"http:\/\/micflan.com\/we-all-have-the-same-24-hours\/","title":"We all have the same 24 hours.","content":"Here's how I'm planning to use mine in 2013.\r\n\r\n<img src=\"http:\/\/micflan.com\/wp-content\/uploads\/2013\/01\/2013-01-01-01.29.37-e1357004519487.png\" alt=\"2013 Day Planner\" title=\"2013\" \/>\r\n\r\nKeeping track of it all with <a href=\"https:\/\/play.google.com\/store\/apps\/details?id=com.intersog.android.schedule\">Schedule Planner<\/a> for Android. It's <em>almost<\/em> the app I was looking for, we'll see in a week or two if it helps me out.\r\n\r\nHappy new year everyone!","excerpt":"Here&#8217;s how I&#8217;m planning to use mine in 2013. Keeping track of it all with Schedule Planner for Android. It&#8217;s almost the app I was looking for, we&#8217;ll see in a week or two if it helps me out. Happy new year everyone!","date":"January 1, 2013 01:46","categories":[{"id":3,"title":"Personal","slug":"personal"}],"tags":[]},{"id":247,"permalink":"http:\/\/micflan.com\/podcasts\/","title":"Podcasts","content":"I just set-up <a href=\"http:\/\/gpodder.org\/\">gPodder<\/a>, which is a nice and simple desktop podcast manager.\r\n\r\nHere's my current listening habits:\r\n\r\n<a href=\"http:\/\/hypem.com\/radio\">Hype Machine Radio Show<\/a> (music)\r\n<a href=\"http:\/\/feeds.kexp.org\/kexp\/musicthatmatters\">KEXP Presents Music That Matters<\/a> (music)\r\n<a href=\"http:\/\/www.bbc.co.uk\/programmes\/b00lvdrj\">Mark Kermode and Simon Mayo's Film Reviews<\/a> (film)\r\n<a href=\"http:\/\/www.npr.org\/rss\/podcast\/podcast_detail.php?siteId=4819413\">NPR: All Songs Considered Podcast<\/a> (music)\r\n<a href=\"http:\/\/www.npr.org\/rss\/podcast\/podcast_detail.php?siteId=124274387\">NPR: Tiny Desk Concerts Podcast<\/a> (music)\r\n<a href=\"http:\/\/twit.tv\/twig\">This Week In Google<\/a> (tech)\r\n<a href=\"http:\/\/twit.tv\/twit\">this WEEK in TECH - MP3 Edition<\/a> (tech)","excerpt":"I just set-up gPodder, which is a nice and simple desktop podcast manager. Here&#8217;s my current listening habits: Hype Machine Radio Show (music) KEXP Presents Music That Matters (music) Mark Kermode and Simon Mayo&#8217;s Film Reviews (film) NPR: All Songs Considered Podcast (music) NPR: Tiny Desk Concerts Podcast (music) This Week In Google (tech) this [...]","date":"September 29, 2012 22:01","categories":[{"id":9,"title":"Music","slug":"music"},{"id":3,"title":"Personal","slug":"personal"},{"id":7,"title":"Technology","slug":"technology"}],"tags":[]},{"id":218,"permalink":"http:\/\/micflan.com\/one-pomodoro\/","title":"One Pomodoro.","content":"I've been using the Pomodoro technique a bit recently, in an attempt to improve my personal time-management.\r\n\r\nIn a nutshell, it's dividing your time into 25 minute segments (each known as a pomodoro) and, well that's pretty much it. Instead of having minutes or hours to spend on a task, you have Pomodoros.\r\n\r\nTo keep on-track it's important to set a 25-minute alarm, or egg-timer, to sound when each Pomodoro ends. In practice, just setting that timer and knowing the clock is ticking turns out to be a great motivator in itself. I also find it's an interesting brain-hack to add this abstraction layer over time. It's not two frantic hours to get a task done, it's four distinct pomodoros. I can get a lot done in four energised and enthusiastic bursts; and that still leaves 20 minutes for polish (or rest).\r\n\r\nIt doesn't suit every task or project (at least I haven't found that it does) but for a lot of things it seems likes a useful technique.\r\n\r\n<strong>Links:<\/strong>\r\n<a href=\"http:\/\/www.pomodorotechnique.com\/\">pomodorotechnique.com<\/a> -- the official website. Far too much going on here, really. It's a pity it's not more simple to reflect the technique itself.\r\n\r\n<a href=\"http:\/\/www.pomodoro.me\/\">pomodoro.me<\/a> -- on the otherhand, very simple. This is what I use to time each Pomodoro.\r\n\r\n<a href=\"https:\/\/en.wikipedia.org\/wiki\/Pomodoro_Technique\">The Wikipedia entry for the Pomodoro Technique<\/a>","excerpt":"I&#8217;ve been using the Pomodoro technique a bit recently, in an attempt to improve my personal time-management. In a nutshell, it&#8217;s dividing your time into 25 minute segments (each known as a pomodoro) and, well that&#8217;s pretty much it. Instead of having minutes or hours to spend on a task, you have Pomodoros. To keep [...]","date":"September 28, 2012 08:49","categories":[{"id":3,"title":"Personal","slug":"personal"}],"tags":[]},{"id":225,"permalink":"http:\/\/micflan.com\/meanwhile-on-the-internet\/","title":"Meanwhile, On The Internet&#8230;","content":"Here's some stuff I've been looking at recently.\r\n\r\n<strong><a href=\"http:\/\/www.vice.com\/read\/whoa-dude-are-we-inside-a-computer-right-now-0000329-v19n9\">Whoa, dude, are we inside a computer right now?<\/a> <\/strong>-- Something fun to think about in this Vice.com article. It makes enough sense to me that \"computers\" (to use a simplistic term) will eventually be able to <em>mimic<\/em> enough of what we consider<em> <\/em>consciousness, to the extent that the mimicry will be indecipherable from the \"real thing\". And perhaps no less <em>real<\/em> at all.  Rich Terrile, a well regarded \"Nasa Scientist\", wonders if this has already happened.\r\n\r\n<strong><a href=\"http:\/\/www.acceler8or.com\/2012\/08\/the-interiorization-of-the-body-the-exteriorization-of-the-mind-mondo-2000-history-project-entry-26\/\">The Interiorization Of The Body. The Exteriorization Of The Mind.<\/a><\/strong> -- A short excerpt from an interview with Terence McKenna in which he considers, from a different angle to the Vice article, the joining of mind and technology.\r\n\r\n<strong><a href=\"http:\/\/www.phptherightway.com\/\">PHP: The Right Way<\/a><\/strong> -- A nice read-through for anyone who codes with PHP. Break some bad habits and pick up some good ones.\r\n\r\n<strong><a href=\"http:\/\/oedb.org\/library\/beginning-online-learning\/ultimate_guide_to_ergonomics\">The Ultimate Guide to Ergonomics.<\/a><\/strong> -- Learn to sit properly. I've been keeping this page handy for the past week or two, whenever I remember it.\r\n\r\n<strong>Robert Anton Wilson - Maybe Logic Exercises.<\/strong> -- A few techniques to challenge your pre-baked perceptions.\r\n[embed]http:\/\/www.youtube.com\/watch?v=Xd8y-r-Tt9g[\/embed]","excerpt":"Here&#8217;s some stuff I&#8217;ve been looking at recently. Whoa, dude, are we inside a computer right now? &#8211; Something fun to think about in this Vice.com article. It makes enough sense to me that &#8220;computers&#8221; (to use a simplistic term) will eventually be able to mimic enough of what we consider consciousness, to the extent that the mimicry will [...]","date":"September 20, 2012 02:57","categories":[{"id":5,"title":"Web","slug":"web"}],"tags":[]},{"id":211,"permalink":"http:\/\/micflan.com\/this-wordpress-theme-on-github\/","title":"This WordPress Theme on GitHub","content":"I've uploaded this <a href=\"https:\/\/github.com\/micflan\/micflan.com-WP-Theme\">Wordpress theme to GitHub<\/a>. For my own benefit really but feel free to grab it and use it if you want to. It's nice and clean and <a href=\"https:\/\/en.wikipedia.org\/wiki\/Responsive_Web_Design\">responsive<\/a> in the basic sense. I like it, anyway.\r\n\r\nThe theme was built using the <a href=\"https:\/\/github.com\/murtaugh\/HTML5-Reset-Wordpress-Theme\/\">HTML5 Reset Wordpress Theme<\/a> by <a href=\"https:\/\/github.com\/murtaugh\">Murtaugh<\/a>. Includes Instagram, Twitter and Ex.fm widgets.","excerpt":"I&#8217;ve uploaded this WordPress theme to GitHub. For my own benefit really but feel free to grab it and use it if you want to. It&#8217;s nice and clean and responsive in the basic sense. I like it, anyway. The theme was built using the HTML5 Reset WordPress Theme by Murtaugh. Includes Instagram, Twitter and Ex.fm widgets.","date":"July 29, 2012 22:20","categories":[{"id":12,"title":"I Made This","slug":"i-made-this"}],"tags":[]},{"id":202,"permalink":"http:\/\/micflan.com\/anonymous-article-on-wired-com\/","title":"Anonymous article on Wired.com","content":"<img src=\"http:\/\/micflan.com\/wp-content\/uploads\/2012\/07\/anonymous_logo.png\" alt=\"Anonymous Logo\" title=\"Anonymous Logo\" width=\"338\" height=\"330\" class=\"aligncenter size-full wp-image-204\" style=\"display: block; margin: auto;\" \/>\r\n\r\nGreat article from Wired on Anonymous: <a href=\"http:\/\/www.wired.com\/threatlevel\/2012\/07\/ff_anonymous\/all\/\">How Anonymous Picks Targets, Launches Attacks, and Takes Powerful Organizations Down<\/a>.\r\n\r\n<blockquote> In the beginning, Anonymous was just about self-amusement, the “lulz,” but somehow, over the course of the past few years, it grew up to become a sort of self-appointed immune system for the Internet, striking back at anyone the hive mind perceived as an enemy of freedom, online or offline. It started as a gang of nihilists but somehow evolved into a fervent group of believers.<\/blockquote>","excerpt":"Great article from Wired on Anonymous: How Anonymous Picks Targets, Launches Attacks, and Takes Powerful Organizations Down. In the beginning, Anonymous was just about self-amusement, the “lulz,” but somehow, over the course of the past few years, it grew up to become a sort of self-appointed immune system for the Internet, striking back at anyone [...]","date":"July 10, 2012 20:38","categories":[{"id":7,"title":"Technology","slug":"technology"},{"id":5,"title":"Web","slug":"web"}],"tags":[]},{"id":199,"permalink":"http:\/\/micflan.com\/jape\/","title":"Jape","content":"Have been listening to this all day. Good music.\r\n\r\n2011 album \"Ocean of Frequency\" on Grooveshark here:\r\n\r\n<object width=\"250\" height=\"250\" classid=\"clsid:D27CDB6E-AE6D-11cf-96B8-444553540000\" id=\"gsManySongs340160633401607792\" name=\"gsManySongs340160633401607792\"><param name=\"movie\" value=\"http:\/\/grooveshark.com\/widget.swf\" \/><param name=\"wmode\" value=\"window\" \/><param name=\"allowScriptAccess\" value=\"always\" \/><param name=\"flashvars\" value=\"hostname=cowbell.grooveshark.com&songIDs=34016063,34016077,34016116,34016128,34016154,34016167,34016181,34016199,34016213,34016215,34016231,-1&bbg=000000&bth=000000&pfg=000000&lfg=000000&bt=FFFFFF&pbg=FFFFFF&pfgh=FFFFFF&si=FFFFFF&lbg=FFFFFF&lfgh=FFFFFF&sb=FFFFFF&bfg=666666&pbgh=666666&lbgh=666666&sbh=666666&p=0\" \/><object type=\"application\/x-shockwave-flash\" data=\"http:\/\/grooveshark.com\/widget.swf\" width=\"250\" height=\"250\"><param name=\"wmode\" value=\"window\" \/><param name=\"allowScriptAccess\" value=\"always\" \/><param name=\"flashvars\" value=\"hostname=cowbell.grooveshark.com&songIDs=34016063,34016077,34016116,34016128,34016154,34016167,34016181,34016199,34016213,34016215,34016231,-1&bbg=000000&bth=000000&pfg=000000&lfg=000000&bt=FFFFFF&pbg=FFFFFF&pfgh=FFFFFF&si=FFFFFF&lbg=FFFFFF&lfgh=FFFFFF&sb=FFFFFF&bfg=666666&pbgh=666666&lbgh=666666&sbh=666666&p=0\" \/><\/object><\/object>\r\n\r\nBuy some albums on 7Digital, here: <a href=\"http:\/\/ie.7digital.com\/search\/query?search-term=jape\">http:\/\/ie.7digital.com\/search\/query?search-term=jape<\/a>.","excerpt":"Have been listening to this all day. Good music. 2011 album &#8220;Ocean of Frequency&#8221; on Grooveshark here: Buy some albums on 7Digital, here: http:\/\/ie.7digital.com\/search\/query?search-term=jape.","date":"July 10, 2012 20:23","categories":[{"id":9,"title":"Music","slug":"music"}],"tags":[]},{"id":190,"permalink":"http:\/\/micflan.com\/stop-motion-the-blu-man\/","title":"Stop-motion: The Blu Man","content":"I made a little stop-motion animation using blu-tack:\r\n\r\n[embed]http:\/\/www.youtube.com\/watch?v=peihY4KR5Yk[\/embed]\r\n\r\nPretty short and insignificant but I had good fun creating it. Also I think I managed well enough with the character movements and timing for a first attempt!\r\n\r\nI used the <a href=\"http:\/\/boinx.com\/istopmotion\/ipad\/\">iStopMotion app for iPad<\/a> to create it, which, along with a good iPad stand, was a fun and easy way to do it. I quickly tried a couple of other stop-motion apps but concluded that iStopMotion was the best all-round. Although I'd like to be able to export the individual frames of the film, or maybe an animated gif file (at the moment it will only export video). Maybe they'll include that in a future update.","excerpt":"I made a little stop-motion animation using blu-tack: Pretty short and insignificant but I had good fun creating it. Also I think I managed well enough with the character movements and timing for a first attempt! I used the iStopMotion app for iPad to create it, which, along with a good iPad stand, was a [...]","date":"June 13, 2012 03:44","categories":[{"id":12,"title":"I Made This","slug":"i-made-this"},{"id":3,"title":"Personal","slug":"personal"}],"tags":[]},{"id":182,"permalink":"http:\/\/micflan.com\/hacktivism-understanding-bitcoin\/","title":"Hacktivism \/ Understanding Bitcoin [Aljazeera]","content":"A good article about an interesting subject (Bitcoin) on Aljazeera:\r\n\r\n<a href=\"http:\/\/www.aljazeera.com\/indepth\/opinion\/2012\/05\/20125309437931677.html\">Understanding Bitcoin - Aljazeera.com<\/a>\r\n\r\nIn particular I like what they have to say about 'hacktivism':\r\n<blockquote>Real hacktivism, then, is less about denial of service attacks, which are acts of digital protest, than about the clever creation or intervention of software forms for social change. It is less about sabotage than about alternatives.\r\n\r\nHacktivism allows dissent to overcome the limitations of protest, actually implementing alternatives and making them widely available without asking for permission from the status quo. It gives wings to the possibility for gradual peaceful revolution: alternatives no longer need to remain dreams, but can become real options for real people.\r\n\r\nHacktivism often opens real spaces by \"selling the idea\" first to the machines, after which people realise other ways are possible and allow themselves to think in new ways.<\/blockquote>","excerpt":"A good article about an interesting subject (Bitcoin) on Aljazeera: Understanding Bitcoin &#8211; Aljazeera.com In particular I like what they have to say about &#8216;hacktivism&#8217;: Real hacktivism, then, is less about denial of service attacks, which are acts of digital protest, than about the clever creation or intervention of software forms for social change. It [...]","date":"June 9, 2012 22:34","categories":[{"id":7,"title":"Technology","slug":"technology"}],"tags":[]},{"id":176,"permalink":"http:\/\/micflan.com\/new-music\/","title":"New Music","content":"Recently, and increasingly, my musical world has been split in two. There's the <em>old music<\/em>, the stuff I've bought and paid for probably many times over. The stuff they're still trying to charge me for again and again -- most recently with subscription services like <a href=\"http:\/\/spotify.com\">Spotify<\/a>, <a href=\"http:\/\/deezer.com\">Deezer<\/a> or <a href=\"http:\/\/rdio.com\">Rdio<\/a>. I love that music and damn it, I'll probably be paying the labels for access to it for a long time to come.\r\n\r\nThen there's the <em>new music<\/em>. Music that's discovered, distributed, shared and often purchased online. Sometimes directly from the artist (which works well for new material from established acts, such as <a href=\"http:\/\/www.thekingoflimbs.com\/Store\/DisplayItems.html\">Radiohead<\/a> or <a href=\"http:\/\/www.nin.com\/albums\/\">Nine Inch Nails<\/a>), and sometimes discovered through sites such as <a href=\"http:\/\/soundcloud.com\/micflan\">SoundCloud<\/a>, <a href=\"http:\/\/ex.fm\/micflan\">Ex.fm<\/a>, <a href=\"http:\/\/mixlr.com\/micflan\">Mixlr<\/a> and <a href=\"http:\/\/bandcamp.com\/\">Bandcamp<\/a>.\r\n\r\nIt's really great to see this new breed of music distribution and discovery sites appear online, and seemingly doing quite well. I've certainly grown to love and rely on them.","excerpt":"Recently, and increasingly, my musical world has been split in two. There&#8217;s the old music, the stuff I&#8217;ve bought and paid for probably many times over. The stuff they&#8217;re still trying to charge me for again and again &#8212; most recently with subscription services like Spotify, Deezer or Rdio. I love that music and damn it, [...]","date":"June 8, 2012 16:11","categories":[{"id":9,"title":"Music","slug":"music"},{"id":7,"title":"Technology","slug":"technology"},{"id":5,"title":"Web","slug":"web"}],"tags":[]},{"id":152,"permalink":"http:\/\/micflan.com\/the-open-web\/","title":"The Open Web","content":"I think some common notions on the importance of Internet \"privacy\" are misguided.\r\n\r\nWhen Google talk about <a href=\"http:\/\/www.guardian.co.uk\/technology\/2012\/apr\/15\/web-freedom-threat-google-brin\" target=\"_blank\">defending the open web<\/a> against the evils of Facebook and Apple's walled garden services, it's easy to point out their ulterior motives. Google's business model is built around the notion, the ideal, of open, free and accessible information. Indexable, searchable (findable) by anyone -- and readable by a legion of scripts and bots to serve up the very best Google Ads, relevant to the content on the page. <em>Of course<\/em> they're going to protest the \"walled garden\" approach.\r\n\r\nHowever, the reality is that the walled garden approach to Internet services simply <em>is<\/em> rubbish. Fair play to Google for working with a business model which encourages, and relies upon, open and free access to information. I'm not suggesting Google are perfect or saintly but they at least seem a good ally in the very worthwhile fight to foster and protect the free flow of information.\r\n\r\nI think sometimes irrational and often over-blown fears about Internet privacy are both encouraged and taken advantage of by these walled gardened supporters, who spin \"your data won't be indexed\/searchable\" into a selling point. The comments on the Guardian article linked above reflect that pretty strongly.\r\n\r\nA level of privacy is important -- the ability to have private conversations and personal relationships hugely important, of course -- but one shouldn't be afraid to be themselves and express their thoughts because they might be \"tracked\" or \"indexed\" by someone, something, a search engine, or a government. I believe the <em>openness<\/em> of the web should be strongly encouraged -- both from a technological and a personal point of view.\r\n\r\nI don't mind that information I put out onto the Internet is indexed. I'm fascinated by what can be achieved, calculated and predicted by having access to vast amounts of data like that. And I particularly like the fact that <em>anyone<\/em> can do it. With an open web, knowledge is truly democratic.\r\n\r\nWhat I fear is that erecting barriers to 'protect' ourselves from the open web is counter-productive to achieving the Internet's full potential on many levels. Socially and politically it makes an easy target of anyone who <em>does<\/em> express alternative points of view, much harder for that person to find support, and -- if the Internet were to become dominated by these <em>singularly-controlled<\/em> <wbr>walled gardens -- trivial for any subversive thought to be stamped out before it begins.<\/wbr>\r\n\r\nWhat I'd like to see is not 1, 2 or 3 Internet silos which we fill with our data. What I'd like to see is a return to, or at least broader encouragement of, personal websites under control of one individual -- all interconnected using open standards.\r\n\r\nThe Internet, or the public manifestation of it, still feels like a very new frontier, but perhaps not as young and innocent as it once was. Where it once seemed direction-less and full of endless possibilities, it's starting to seem as though the tracks are getting laid down and decisions being made about the direction they face. If we're heading to a place where the worlds knowledge and information (social or otherwise) is closed and locked-up for \"our security\", under control of just a few (and their customers), well that's not the ticket I queued up for.","excerpt":"I think some common notions on the importance of Internet &#8220;privacy&#8221; are misguided. When Google talk about defending the open web against the evils of Facebook and Apple&#8217;s walled garden services, it&#8217;s easy to point out their ulterior motives. Google&#8217;s business model is built around the notion, the ideal, of open, free and accessible information. Indexable, [...]","date":"April 16, 2012 16:05","categories":[{"id":7,"title":"Technology","slug":"technology"},{"id":5,"title":"Web","slug":"web"}],"tags":[]},{"id":145,"permalink":"http:\/\/micflan.com\/instagram\/","title":"Instagram","content":"<a href=\"http:\/\/twitter.com\/jwhelton\">James Whelton<\/a> put together <a href=\"http:\/\/gramgrab.com\/\">GramGrab<\/a> during the week (code available on <a href=\"https:\/\/github.com\/jwhelton\/gramgrab\">GitHub<\/a>), which acts as a handy web front-end for viewing and downloading your <a href=\"http:\/\/instagram.com\/\">Instagram<\/a> photos.\r\n\r\nIt's useful and inspired me to have a quick look over the <a href=\"http:\/\/instagr.am\/developer\/\">Instagram API<\/a>. I've used it to add some recent shots to the top of this blog. I think that works well.","excerpt":"James Whelton put together GramGrab during the week (code available on GitHub), which acts as a handy web front-end for viewing and downloading your Instagram photos. It&#8217;s useful and inspired me to have a quick look over the Instagram API. I&#8217;ve used it to add some recent shots to the top of this blog. I [...]","date":"April 15, 2012 17:38","categories":[{"id":6,"title":"Creativity","slug":"creativity"},{"id":7,"title":"Technology","slug":"technology"},{"id":5,"title":"Web","slug":"web"}],"tags":[]},{"id":86,"permalink":"http:\/\/micflan.com\/weekend-film\/","title":"Weekend (film)","content":"<img class=\"alignnone size-full wp-image-87\" style=\"width: 100%;\" title=\"weekend\" src=\"http:\/\/micflan.com\/wp-content\/uploads\/2012\/03\/weekend.jpg\" alt=\"Weekend\" \/>\r\n\r\nA very simple story -- boy meets boy and they spend the titular Weekend together -- the film centres on the conversation between the two lovers. A bit like a gay <a href=\"http:\/\/www.imdb.com\/title\/tt0112471\">Before Sunrise<\/a>. Only less American. And with more (gay) sex.\r\n\r\nIt's not too raunchy, though. It is very well constructed and feels very real. Fantastic performances from both actors.\r\n\r\nIf you're gay: you should go watch it. If you're not, there's actually a point made in the film when Glen (<a href=\"http:\/\/www.imdb.com\/name\/nm2773325\/\">Chris New<\/a>) is talking about an art exhibition he's wanted to put on, which would have a \"gay\" theme. But he's not sure to bother. He laments, because of the theme, that the straights won't go because \"gay\" has nothing to do with them, and the gays will only go to try and catch a glimpse of cock.\r\n\r\nSo, yes, there is gay sex in the film -- but it's not about that. It's also not often or gratuitous. It's a film about a conversation, a fleeting relationship, and a well made piece of low-budget indie film-making. If you're straight, you should go watch it.\r\n\r\n\r\nWeekend (2011): <a href=\"http:\/\/www.imdb.com\/title\/tt1714210\">IMDb<\/a> -- <a href=\"http:\/\/en.wikipedia.org\/wiki\/Weekend_(2011_film)\">Wikipedia<\/a> -- <a href=\"http:\/\/www.netflix.com\/Movie\/Weekend\/70178273\">Netflix (US)<\/a>","excerpt":"A very simple story &#8212; boy meets boy and they spend the titular Weekend together &#8212; the film centres on the conversation between the two lovers. A bit like a gay Before Sunrise. Only less American. And with more (gay) sex. It&#8217;s not too raunchy, though. It is very well constructed and feels very real. Fantastic [...]","date":"April 5, 2012 03:40","categories":[{"id":4,"title":"Film","slug":"film"},{"id":8,"title":"Gay \/ LGBT","slug":"gay-lgbt"}],"tags":[]},{"id":124,"permalink":"http:\/\/micflan.com\/pearl-jam-20\/","title":"Pearl Jam 20","content":"<img src=\"http:\/\/micflan.com\/wp-content\/uploads\/2012\/04\/pj20.jpg\" alt=\"\" title=\"pj20\" class=\"alignnone size-full wp-image-125\" \/>\r\n\r\nI'd usually be a bit apprehensive about \"rockumetaries\". Danger of them being either officially sanctioned and self indulgent, or independent and frankly useless... but I gave this one a chance recently and I'm glad I did.\r\n\r\nThe music is, of course, brilliant. The journey of the band from early 90's Seattle to massive success is as interesting as any other (or perhaps more so, due to my foundness for early 90's Seattle rock groups) and there's no denying Cemeron Crowe can stitch a film together.\r\n\r\nWell worth watching. <a href=\"http:\/\/www.imdb.com\/title\/tt1417592\">IMDb<\/a> -- <a href=\"http:\/\/en.wikipedia.org\/wiki\/Pearl_Jam_20\">Wikipedia<\/a> -- <a href=\"http:\/\/www.netflix.com\/Movie\/Pearl-Jam-Twenty\/70208108\">Netflix (US)<\/a>.","excerpt":"I&#8217;d usually be a bit apprehensive about &#8220;rockumetaries&#8221;. Danger of them being either officially sanctioned and self indulgent, or independent and frankly useless&#8230; but I gave this one a chance recently and I&#8217;m glad I did. The music is, of course, brilliant. The journey of the band from early 90&#8242;s Seattle to massive success is [...]","date":"April 4, 2012 04:44","categories":[{"id":4,"title":"Film","slug":"film"},{"id":9,"title":"Music","slug":"music"}],"tags":[]},{"id":98,"permalink":"http:\/\/micflan.com\/iphones-and-androids-prices-and-contracts\/","title":"iPhones and Androids, Prices and Contracts","content":"<img class=\"alignnone size-full wp-image-99\" title=\"billpay\" src=\"http:\/\/micflan.com\/wp-content\/uploads\/2012\/04\/billpay.jpg\" alt=\"Bill Pay Plans\" \/>\r\n\r\nI was looking at the cost of smart phones recently on the Irish network, <a href=\"https:\/\/store.meteor.ie\/phones\/\">Meteor<\/a>. I couldn't really understand why the iPhone was so much cheaper at €49, compared to €119 for Galaxy Nexus, or €129 for the Galaxy S2. But I wasn't looking with any intention to buy, so didn't dwell on it at the time.\r\n\r\nYesterday, there was a somewhat related thread on <a href=\"http:\/\/boards.ie\/\">Boards.ie<\/a> and I mentioned that the price on offer makes the iPhone much more attractive. Someone cleared it up: look at the contracts.\r\n\r\nMeteor have <a href=\"https:\/\/store.meteor.ie\/phones\/bill-pay-phones\/apple-iphone-4s\">special contracts<\/a> for their iPhone users. These start at €45\/month for 24 months, which gets you 200 texts, 200 minutes and 5GB of data. Plus the €49 once-off fee, that means you're locked into paying <strong>€1174<\/strong> for the phone + service over 2 years.\r\n\r\nThe Android phones use the <a href=\"http:\/\/www.meteor.ie\/bill-pay\/#phone-plans\">standard meteor contracts<\/a>: a minimum €20\/month for 18 months, getting you 200 texts, 200 minutes and 1GB of data. (18 * 20) + 119 = <strong>€479<\/strong>. So actually, much <em>much<\/em> cheaper. Just a bit more up front.\r\n\r\nThe only difference the iPhone contract has over a standard contract is the tasty 5GB of data (compared with 1GB) but if you need more than one (which is probably fine for most), a 10GB add-on costs €15.24\/month, and that's still cheaper: (18 * 20) + 119 + (18 * 16) = €767. And twice the size! Although I'd prefer 5GB and half the price myself, but unfortunately they don't do that.\r\n\r\nSneaky feckers.","excerpt":"I was looking at the cost of smart phones recently on the Irish network, Meteor. I couldn&#8217;t really understand why the iPhone was so much cheaper at €49, compared to €119 for Galaxy Nexus, or €129 for the Galaxy S2. But I wasn&#8217;t looking with any intention to buy, so didn&#8217;t dwell on it at [...]","date":"April 3, 2012 03:52","categories":[{"id":7,"title":"Technology","slug":"technology"}],"tags":[]},{"id":72,"permalink":"http:\/\/micflan.com\/return-of-the-show\/","title":"Return of The Show","content":"<a href=\"http:\/\/micflan.com\/wp-content\/uploads\/2012\/03\/zefrank.jpg\"><img class=\"alignnone size-full wp-image-74\" style=\"width: 100%;\" title=\"zefrank\" src=\"http:\/\/micflan.com\/wp-content\/uploads\/2012\/03\/zefrank-e1332124979600.jpg\" alt=\"Ze Frank\" \/><\/a>\r\n\r\nGreat to hear <a href=\"http:\/\/www.zefrank.com\/theshow\/\">The Show<\/a> is coming back! Ze Frank <a href=\"http:\/\/www.kickstarter.com\/projects\/zefrank\/a-show-with-ze-frank\">crowd-sourced $150k via Kickstarter<\/a> to make it happen.\r\n\r\nI remember I was living in Prague when the original was released in 2006. Good times. A fantastic little bit of Internet.\r\n\r\n&nbsp;\r\n\r\nThe whole concept of The Show seemed barely more thought out than \"release a video on the Internet every Monday to Friday for one year\". Mostly everything else was improv, ranging from whacky and surreal to sombre and heartfelt. A public experiment in forced creativity <em>every day<\/em>.\r\n\r\nHopefully this new Show won't suffer too much for being that \"difficult second album\" -- or from having $150k to play with and a legion of waiting fans. I'm definitely looking forward to finding out!","excerpt":"Great to hear The Show is coming back! Ze Frank crowd-sourced $150k via Kickstarter to make it happen. I remember I was living in Prague when the original was released in 2006. Good times. A fantastic little bit of Internet. &nbsp; The whole concept of The Show seemed barely more thought out than &#8220;release a [...]","date":"March 19, 2012 02:57","categories":[{"id":6,"title":"Creativity","slug":"creativity"},{"id":5,"title":"Web","slug":"web"}],"tags":[]},{"id":57,"permalink":"http:\/\/micflan.com\/paul-irish-talks-new-html5-at-sxsw\/","title":"Paul Irish talks new HTML5 at SXSW","content":"[embed]http:\/\/www.youtube.com\/watch?v=zH5bJSG0DZk#t=6657s[\/embed]\r\n\r\nA 'lightning talk' and Q+A session with <a href=\"http:\/\/paulirish.com\/\">Paul Irish<\/a>, at <a href=\"http:\/\/sxsw.com\/\">SXSW<\/a>, talking about some new features in HTML5. Including CSS regions, filters, network connection API's, fullscreen API's and more.","excerpt":"A &#8216;lightning talk&#8217; and Q+A session with Paul Irish, at SXSW, talking about some new features in HTML5. Including CSS regions, filters, network connection API&#8217;s, fullscreen API&#8217;s and more.","date":"March 15, 2012 20:11","categories":[{"id":5,"title":"Web","slug":"web"}],"tags":[]},{"id":50,"permalink":"http:\/\/micflan.com\/film-c-r-a-z-y\/","title":"C.R.A.Z.Y.","content":"<a href=\"http:\/\/micflan.com\/wp-content\/uploads\/2012\/03\/crazy.jpg\"><img class=\"alignnone size-full wp-image-51\" title=\"Crazy\" src=\"http:\/\/micflan.com\/wp-content\/uploads\/2012\/03\/crazy.jpg\" alt=\"C.R.A.Z.Y.\" \/><\/a>\r\n\r\nFrench Canadian film about a boy growing up and coming to terms with his sexuality, with a focus on his family relationships - in particular with his father.\r\n\r\nI really enjoyed it.\r\n\r\nWatch on <a href=\"www2.netflix.com\/Movie\/C.R.A.Z.Y.\/70051094\">Netflix (US)<\/a>. Browse on <a href=\"http:\/\/www.imdb.com\/title\/tt0401085\/\">IMDb<\/a>.\r\n\r\nTrailer (in French, couldn't find one with subtitles):\r\n\r\n[embed]http:\/\/www.youtube.com\/watch?v=nAZEwKn7qXo[\/embed]","excerpt":"French Canadian film about a boy growing up and coming to terms with his sexuality, with a focus on his family relationships &#8211; in particular with his father. I really enjoyed it. Watch on Netflix (US). Browse on IMDb. Trailer (in French, couldn&#8217;t find one with subtitles):","date":"March 9, 2012 14:15","categories":[{"id":4,"title":"Film","slug":"film"},{"id":8,"title":"Gay \/ LGBT","slug":"gay-lgbt"}],"tags":[]},{"id":10,"permalink":"http:\/\/micflan.com\/in-an-extroverts-world\/","title":"In an Extroverts World.","content":"<img src=\"http:\/\/micflan.com\/wp-content\/uploads\/2012\/03\/introverts.png\" alt=\"\" title=\"introverts\" class=\"alignnone size-full wp-image-137\" \/>\r\n\r\nIt took me a while to become comfortable as an introvert -- or to even acknowledge that <em>being an introvert<\/em> was an acceptable thing to be, and not something which should be shaken off or grown out of eventually. These days I try to stop apologising and making excuses. I don't crave the attention of a crowd and I don't gain energy from the energy and enthusiasm of having many people around me. In those situations I find myself sitting quietly, observing, listening. I'll form my opinions and contribute in my own way, in my own time. I don't enjoy the rabble.\r\n\r\nPeople observing this often put it down to shyness, social awkwardness or an unhealthy aversion to people. That's not the case. Forcing yourself to conform to an outgoing extrovert norm <em>can<\/em> be awkward -- as much as trying anything which goes against your natural instincts and impulses -- but as an introvert needs seem different to the majority who require regular social interactions for a steady, healthy mind. I like the small doses, absolutely, but without having my time alone to recharge, think, dream and create -- I'm liable to get a little cranky.\r\n\r\nThe difference of acceptance is that I'm now willing to embrace the time alone, trying to make the most out of it and not feeling guilty or inadequate for sitting in with a cup of tea researching <a href=\"http:\/\/nodejs.org\/\">Node.js<\/a> or <a href=\"http:\/\/www.codecademy.com\/\">brushing up on my JavaScript<\/a> on a Saturday night. Weekends are a mess of extroversion and social excess; I'll catch up with my friends during the week. And I'll look forward to that.\r\n\r\nBut. There is also the reality which is not wise to ignore: it's an extroverts world out there. As a society we tend to celebrate those who can shout the loudest, network the farthest and mesmerise an audience with the power of their voice and presence. These are fantastic and certainly enviable qualities to have, to an introvert they're far from natural. Thus we risk being forgotten, left on the bank as the river of extroversion rushes past towards an ocean of opportunities.\r\n\r\nAs introverts we need to both embrace this side of our personalities but also we must learn how to live and prosper in the extroverts world. The Internet certainly offers many great opportunities (keeping a blog, for instance) -- while at other times it really is worth putting that extra effort in and stepping, momentarily, outside the comfort zones. Just don't feel bad for maintaining the balance that's healthy <em>for you<\/em>.\r\n\r\nSee links below for more tails of introversion and tips for keeping up with all those beautiful extroverts out there.\r\n\r\n<hr \/>\r\n\r\n<h5>Further reading \/ viewing<\/h5>\r\n<ul>\r\n\t<li>A nice, short, and on-topic SlideShare presentation I read this week is <a href=\"http:\/\/www.slideshare.net\/sachac\/the-shy-connector\">The Shy Connector<\/a> from Sacha Chua, which offers 7 tips on how to network and influence people without forsaking the natural introvert inside.<\/li>\r\n\t<li>A recent TED talk entitled <a href=\"http:\/\/www.ted.com\/talks\/susan_cain_the_power_of_introverts.html\">The Power of Introverts<\/a> by Susan Cain offers her story of accepting and embracing her own introversion. (<a href=\"http:\/\/www.youtube.com\/watch?v=3yyeJ1jaGDU\">Alternative YouTube link<\/a>).<\/li>\r\n\t<li>And something I found enlightening and inspirational when I first read it last year -- <a href=\"http:\/\/www.carlkingdom.com\/10-myths-about-introverts\">10 Myths About Introverts<\/a> by Carl King.<\/li>\r\n<\/ul>","excerpt":"It took me a while to become comfortable as an introvert &#8212; or to even acknowledge that being an introvert was an acceptable thing to be, and not something which should be shaken off or grown out of eventually. These days I try to stop apologising and making excuses. I don&#8217;t crave the attention of a crowd and [...]","date":"March 5, 2012 05:23","categories":[{"id":3,"title":"Personal","slug":"personal"}],"tags":[]},{"id":5,"permalink":"http:\/\/micflan.com\/a-whole-new-blog\/","title":"A Whole New Blog.","content":"I've decided to start a blog that's slightly detached from the rest of my online existence.\r\n\r\nThe goal isn't to hide away or be \"anonymous\" -- and I may even tweet, link or Facebook to a post on this site in future if it suits me -- but what I want for now is a blank page to work on.\r\n\r\nI threw the blog together using <a href=\"http:\/\/wordpress.org\/\">WordPress<\/a> and the excellent <a href=\"https:\/\/github.com\/murtaugh\/HTML5-Reset-Wordpress-Theme\">HTML5 Reset Wordpress Theme<\/a>, which gives you some minimalist, totally un-styled, HTML5 markup to start out a template with.\r\n\r\nIn terms of added style and layout, this is just about as minimal as I could possibly get things. Again, the blank page. For now this is all that's needed. I don't <em>have<\/em> categories or archives or tags or even comments...I'm starting on empty.\r\n\r\nFill it up as she goes.","excerpt":"I&#8217;ve decided to start a blog that&#8217;s slightly detached from the rest of my online existence. The goal isn&#8217;t to hide away or be &#8220;anonymous&#8221; &#8212; and I may even tweet, link or Facebook to a post on this site in future if it suits me &#8212; but what I want for now is a blank page to [...]","date":"March 3, 2012 01:07","categories":[{"id":3,"title":"Personal","slug":"personal"}],"tags":[]}]