{"uid":"openvpn-on-amazon-aws-free-usage-tier","content":"I finally got around to setting up my <a href=\"http:\/\/en.wikipedia.org\/wiki\/Virtual_private_network\" target=\"_blank\">VPN server<\/a> last night on Amazon Web Services. Following a couple of guides made the whole thing fairly painless – so mostly I'm just going to point towards them, with a couple of notes of my own.\r\n\r\n<h3>VPN?<\/h3>\r\nFirstly, a VPN server (those who know can skip this bit) is literally a <em>Virtual Private Network<\/em>. You might be familiar with how your home or office network operates – many computers connected to the same WiFi or ethernet network. For the most part we do this simply to share an Internet connection, however, another upshot is the ability to share files and services (e.g. documents, audio, video, printers or scanners) between these machines – with access only available to machines on your <em>local network<\/em>.\r\n\r\nYou can think of a VPN in similar terms, only the <em>Local<\/em> is replaced with <em>Virtual Private<\/em>. The physical connection between what were once, by necessity, centrally located machines is replaced with a Virtual connection – and your access to those files and services is now available from any authenticated machine with a data connection, anywhere in the world. Pretty cool.\r\n\r\n<h3>OK, what do I need?<\/h3>\r\n\r\nAt it's simplest, creating a VPN requires two components – you need a server running the server component, and a client to connect to it. Actually it only <em>really<\/em> starts making sense when you have two clients (a network of one isn't much of a network!), but the setting up of the second is just the same as the first.\r\n\r\n<h4>Client<\/h4>\r\nYour first client could be the machine you're reading this on now, or any laptop or computer you want to use. \r\n\r\nMy client machine is running Linux (Mint 14). If you're on an Apple machine most of this guide should still be relevant – although perhaps the client setup will differ.\r\n\r\n<h4>Server<\/h4>\r\nFor the server I decided to use Amazon Web Services, mostly because I've still got a few months left on their <a href=\"http:\/\/aws.amazon.com\/free\/\" target=\"_blank\">Free Usage Tier<\/a> and you just can't beat that price.\r\n\r\n<h3>Step 1 – Setting up on Amazon Web Services<\/h3>\r\nThis <a href=\"http:\/\/expedienttech.net\/?p=68\" target=\"_blank\">guide by Expedient Tech<\/a> covers setting up your EC2 server. Follow this but go for Ubuntu 12.04 instead of 9.1. I don't see any reason to go back that far, maybe the guide is just old.\r\n\r\nWhen they start talking about using PuTTy and installing OpenVPN that way, forget about it. That's crazy Windows talk. All you need is shell access and by now you have the pem key from amazon, so – on your client machine – you just need to fire up a terminal window and type:\r\n\r\n<code>ssh -i \/path\/to\/yourkey.pem ubuntu@your-sever-address.amazonaws.com<\/code>\r\n\r\nYou should now be logged-in to your new Amazon EC2 instance.\r\n\r\n<h3>Step 2 & 3 – OpenVPN Client and Server<\/h3>\r\nNow switch to <a href=\"https:\/\/help.ubuntu.com\/12.04\/serverguide\/openvpn.html\" target=\"_blank\">Ubuntu 12.04's OpenVPN guide<\/a>. Follow those steps to the letter and you should be setup on both Server and Client.\r\n\r\n<h3>And...<\/h3>\r\nAnd.. that should be that! You can generate a second client certificate the same way you've done the first and connect a second machine. Each client connected to the network is given a unique IP address available only to other machines on the network, allowing you to connect and share securely. Sit happily in a coffee shop while you finish up a project on the machine back home, via your humble little laptop. Or stream music from your private collection through your phone at a party.\r\n\r\nLots of fun.","date":"January 27, 2013 02:59","title":"OpenVPN on Amazon AWS Free Usage Tier","article_css":"","template_file":false,"categories":["Technology"],"author":"Michael Flanagan"}