{"uid":"star-wars-machete-order","content":"I did the Star Wars 'Machete Order' over the recent Christmas break. <a href=\"http:\/\/static.nomachetejuggling.com\/machete_order.html\">The website<\/a> goes into detail but in a nutshell, it involves watching Episodes 4, 5, 2, 3 and 6. In that order.\r\n\r\nNote that this isn't about watching them back-to-back in a massive marathon sitting! Well, not unless you want to. This is just about the order you watch them in.\r\n\r\nTurned out to be a great way to watch the films. Nothing is missed from leaving out episode one and the remaining two prequel episodes fit in at a time, just after Empire Strikes Back, when you're perfectly primed and eager to learn more about the Anakin\/Vader backstory. And it all gets nicely concluded with Episode 6.\r\n\r\nViewing in chronological order, 1 to 6 or even 2 to 6, is far too much information far too soon. The mystery of Darth Vader is diminished by the time you get to Episode 4, the revelation in 5 is meaningless.\r\n\r\nViewing in release order isn't much better. With 4 to 6 followed by 1 to 3, you're left with an ending in the middle and a middle at the end (Episode 3 ends on quite a downer!). So really, 'Machete Order' makes a lot of sense.\r\n\r\nAlso nice to remember that A New Hope and Empire Strikes Back are still fantastic films. Thoroughly enjoyed watching them both again. Attack of the Clones was the worst of the bunch by a fair margin but after Empire the backstory and details do at least seem more interesting. Revenge of the Sith was much better than I remembered! And Return of the Jedi was pretty much just as I'd remembered. Good in places, silly or dull in others, and the cast seems a little less enthusiastic and a bit older all of a sudden.\r\n\r\nAnd if you're going to do this -- or watch any Star Wars ever again -- do yourself a favour, Google and download the 'Despecialized Edition'. Brilliant 'blu-ray quality' restorations of the <em>original<\/em> Original Trilogy. Insanely great.","date":"January 9, 2013 17:34","title":"Star Wars: Machete Order","article_css":"","template_file":false,"categories":["Film"],"author":"Michael Flanagan"}