{"uid":"the-open-web","content":"I think some common notions on the importance of Internet \"privacy\" are misguided.\r\n\r\nWhen Google talk about <a href=\"http:\/\/www.guardian.co.uk\/technology\/2012\/apr\/15\/web-freedom-threat-google-brin\" target=\"_blank\">defending the open web<\/a> against the evils of Facebook and Apple's walled garden services, it's easy to point out their ulterior motives. Google's business model is built around the notion, the ideal, of open, free and accessible information. Indexable, searchable (findable) by anyone -- and readable by a legion of scripts and bots to serve up the very best Google Ads, relevant to the content on the page. <em>Of course<\/em> they're going to protest the \"walled garden\" approach.\r\n\r\nHowever, the reality is that the walled garden approach to Internet services simply <em>is<\/em> rubbish. Fair play to Google for working with a business model which encourages, and relies upon, open and free access to information. I'm not suggesting Google are perfect or saintly but they at least seem a good ally in the very worthwhile fight to foster and protect the free flow of information.\r\n\r\nI think sometimes irrational and often over-blown fears about Internet privacy are both encouraged and taken advantage of by these walled gardened supporters, who spin \"your data won't be indexed\/searchable\" into a selling point. The comments on the Guardian article linked above reflect that pretty strongly.\r\n\r\nA level of privacy is important -- the ability to have private conversations and personal relationships hugely important, of course -- but one shouldn't be afraid to be themselves and express their thoughts because they might be \"tracked\" or \"indexed\" by someone, something, a search engine, or a government. I believe the <em>openness<\/em> of the web should be strongly encouraged -- both from a technological and a personal point of view.\r\n\r\nI don't mind that information I put out onto the Internet is indexed. I'm fascinated by what can be achieved, calculated and predicted by having access to vast amounts of data like that. And I particularly like the fact that <em>anyone<\/em> can do it. With an open web, knowledge is truly democratic.\r\n\r\nWhat I fear is that erecting barriers to 'protect' ourselves from the open web is counter-productive to achieving the Internet's full potential on many levels. Socially and politically it makes an easy target of anyone who <em>does<\/em> express alternative points of view, much harder for that person to find support, and -- if the Internet were to become dominated by these <em>singularly-controlled<\/em> <wbr>walled gardens -- trivial for any subversive thought to be stamped out before it begins.<\/wbr>\r\n\r\nWhat I'd like to see is not 1, 2 or 3 Internet silos which we fill with our data. What I'd like to see is a return to, or at least broader encouragement of, personal websites under control of one individual -- all interconnected using open standards.\r\n\r\nThe Internet, or the public manifestation of it, still feels like a very new frontier, but perhaps not as young and innocent as it once was. Where it once seemed direction-less and full of endless possibilities, it's starting to seem as though the tracks are getting laid down and decisions being made about the direction they face. If we're heading to a place where the worlds knowledge and information (social or otherwise) is closed and locked-up for \"our security\", under control of just a few (and their customers), well that's not the ticket I queued up for.","date":"April 16, 2012 16:05","title":"The Open Web","article_css":"","template_file":false,"categories":["Technology","Web"],"author":"Michael Flanagan"}