{"uid":"thoughts-on-enhancing-your-phpness","content":"<a href=\"\/assets\/\/2013\/02\/phpness.jpg\" alt=\"Enhance your PHPness\">This t-shirt<\/a> caused <a href=\"http:\/\/blog.calevans.com\/2013\/02\/22\/sexism-and-php\/\">a bit of<\/a> a <a href=\"http:\/\/www.brandonsavage.net\/on-public-outrage-and-bad-actors\/\">moral outrage<\/a> recently following a PHP conference in London. I've commented on Twitter and on a couple of <a href=\"http:\/\/erikaheidi.com\/2013\/02\/24\/the-phpness-riot-and-the-sexism-overreaction\/\">blog posts<\/a> and I'd also like to record my thoughts here, for the record.\r\n\r\nFor me, the question of it being appropriate or not among professionals or at a conference is a separate issue. If that were the argument being raised I suspect it would (rightfully) be a quieter one, and I’d be leaning towards the position that no, it’s not the most appropriate slogan.\r\n\r\nBut sexism – “discrimination on the basis of sex” – I’m deeply disappointed that some in the community would be so quick, brutal, and public with that accusation. Even going so far as to state unequivocally that any argument to the contrary is <a href=\"http:\/\/www.brandonsavage.net\/on-public-outrage-and-bad-actors\/\">“part of the problem”<\/a>. It’s a sad day when discussion is disallowed.\r\n\r\nYes we can strive for more professionalism within the community, but we are all adults here. There is absolutely a difference between a mild sexual reference pun and sexual discrimination.\r\n\r\nIt also seems there were many who <a href=\"https:\/\/gist.github.com\/AmyStephen\/5021337\">quickly jumped to the conclusion<\/a> (and apologised for only as an aside) that these women were some sort of hired “Booth Babes”. If that were your assumption then I think a long look in the mirror is needed before you start bandying around accusations of sexism.\r\n\r\nI sincerely believe that apologies are in order and I wish the women – and men – at <a href=\"webandphp.com\">webandphp.com<\/a> all the best in future. A slight misstep in humour is by no means deserving of this very public, serious and potentially damaging accusation.","date":"February 25, 2013 12:55","title":"Thoughts on enhancing your PHPness","article_css":"","template_file":false,"categories":["Personal","Technology","Web"],"author":"Michael Flanagan"}